<script setup>
import Service from "@/components/Service.vue";
import Faq from "@/components/Faq.vue";
import BannerSecond from "@/components/BannerSecond.vue";
import Reviews from "@/components/Reviews.vue";
import Location from "@/components/Location.vue";
import Advantages from "@/components/Advantages.vue";
import Reasons from "@/components/Reasons.vue";

import { ref, watch } from "vue";
import { useRoute } from "vue-router";

const route = useRoute();

const service = ref([
      {
            id: 1,
            title: "Квота РВП для иностранцев",
            price: "20.000 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Объективная оценка ваших перспектив в получении квоты",
                  },
                  {
                        title: "Подготовка заявления по форме 2023 года на квоту РВП в Москве или Мос.обл",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в МВД (ММЦ Сахарово или Мос.обл)",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении одного месяца вы получаете квоту. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Что дает оформление квоты для иностранцев",
                  desc: "Иностранные граждане и лица без гражданства, временно пребывающие в Российской Федерации, вправе получить квоту на временное проживание в Российской Федерации на конкурсной основе в порядке, установленном законом. Получение Разрешения на временное проживание в Российской Федерации в рамках квоты даёт возможность зарегистрироваться по месту жительства в Российской Федерации и не делать регистрацию заново в случае выезда из Российской Федерации, в том числе не продлевать временную регистрацию каждые 3 месяца, появляется возможность осуществлять предпринимательскую деятельность в качестве индивидуального предпринимателя, получить Вид на Жительство после 1 года проживания в Российской Федерации, работать в течение срока действия РВП без оформления патента.",
            },
            reasons: {
                  title: "Почему заказывают помощь в оформлении квоты РФ у нас?",
                  desc: `Рады предложить Вам наш широкий спектр услуг, могущий поспособствовать получению Разрешения на временное проживание на основании ежегодно утверждаемой квоты. С каждым клиентом мы работаем исключительно на совесть, доводя абсолютно каждого до положительного результата в решении поставленной перед нами задачи. Сотрудничество с клиентом ведётся полностью под ключ, с минимумом телодвижений с Вашей стороны. В случае, если для получения каких-то документов, решения каких-то вопросов необходимо ваше личное присутствие, предварительно проконсультируем относительно алгоритма действий, который необходимо совершить, с пошаговым разъяснением каждой итерации, вплоть до помощи с навигацией в определенной местности либо лично сопроводим Вас при наличии на то объективной возможности. Выбирая сотрудничество с нами, Вы получаете индивидуальный подход к каждому случаю и добросовестную работу на результат со стороны каждого из наших юристов.`,
            },
      },
      {
            id: 2,
            title: "Помощь в получении РВП РФ для иностранцев",
            price: "35.000 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Объективная оценка ваших перспектив в получении РВП",
                  },
                  {
                        title: "Подготовка заявления по форме 2023 года на оформление РВП в Москве или Мос.обл",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в МВД (ММЦ Сахарово или Мос.обл)",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении двух-трех месяцев вы получите РВП РФ. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Что дает оформление рВП в РФ для иностранцев",
                  desc: "После получения РВП при желании есть возможность оформить в упрощенном порядке ВНЖ Российской Федерации. Нет необходимости уезжать с территории РФ. С РВП иностранцы могут находиться на территории Российской Федерации до трех лет без выезда. Это очень удобно, нет необходимости приобретать билеты. С РВП в РФ иностранный гражданин может работать без патента на работу. Это экономически выгодно.",
            },
            reasons: {
                  title: "Почему заказывают помощь в оформлении РВП РФ у нас?",
                  desc: `Оформить РВП в России возможно лишь по основаниям, т.е. льготного порядка получения РВП не существует, иностранному гражданину необходимо иметь основание, либо получать квоту. Конечно же есть исключение из правил, упрощенное получение РВП в РФ для определенных иностранцев все же есть. РВП в упрощенном порядке получают граждане Украины, Молдовы, а также Казахстана. Так же можно получить РВП по основаниям профессии, высшему образованию и тд. Главными документами для подачи на РВП являются:
                        <br /><br />
                        1. Паспорт иностранного гражданина (Включая нотариально заверенный перевод); </br>
                        2. Миграционная карта;</br>
                        3. Уведомление в место прибытия (Регистрация);</br>
                        4. Основания (В разных случаях это допустим трудовая книжка, если РВП получают по основаниям профессии).</br>
                        <br />
                        Наша компания занимается подготовкой РВП под ключ с 2009 года. В нашем штате имеются миграционные юристы с большим опытом работы в данной сфере. Мы предоставляем юридическое сопровождение иностранных граждан на всех этапах сдачи документов независимо от оснований. Наш многолетний опыт работы дает Вам гарантию положительного результата при оформлении документов. Для получения РВП ниже представлены разделы, выберете нужный для Вас.`,
            },
      },
      {
            id: 3,
            title: "Получение РВПО для иностранцев",
            price: "25.000 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Объективная оценка ваших перспектив в получении РВПО",
                  },
                  {
                        title: "Подготовка заявления по форме 2023 года на оформление РВПО в Москве или Мос.обл",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в МВД (ММЦ Сахарово или Мос.обл)",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении двух-трех месяцев вы получаете Разрешение на временное пребывание в РФ. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Что дает оформление разрешения на временное пребывание по обучению для иностранцев",
                  desc: "После получения РВП при желании есть возможность оформить в упрощенном порядке ВНЖ Российской Федерации. Нет необходимости уезжать с территории РФ. С РВП иностранцы могут находиться на территории Российской Федерации до трех лет без выезда. Это очень удобно, нет необходимости приобретать билеты. С РВП в РФ иностранный гражданин может работать без патента на работу. Это экономически выгодно.",
            },
            reasons: {
                  title: "Почему заказывают помощь в оформлении РВПО РФ у нас?",
                  desc: `Вы хотите учиться в России, но у вас нет разрешения на временное пребывание? Не проблема! Мы предлагаем вам услугу по получению разрешения на временное пребывание для обучения в России.
                        </br>
                        </br>
                        Наша компания имеет многолетний опыт работы в данной сфере и готова помочь вам получить разрешение на временное пребывание. Мы гарантируем быстрое и качественное оформление документов, а также полное сопровождение на всех этапах процедуры.
                        </br>
                        </br>
                        Кроме того, мы предлагаем индивидуальный подход к каждому клиенту и готовы учитывать все ваши пожелания и требования. Наша цель — сделать процесс получения разрешения на временное пребывание максимально удобным и комфортным для вас.`,
            },
      },
      {
            id: 4,
            title: "Получение ВНЖ РФ для иностранцев",
            price: "35.000 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Объективная оценка ваших перспектив в получении РВПО",
                  },
                  {
                        title: "Подготовка заявления по форме 2023 года на оформление РВПО в Москве или Мос.обл",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в МВД (ММЦ Сахарово или Мос.обл)",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении четырех месяцев вы получаете Вид на жительство в РФ. 100% законно и официально!",
                  },
            ],

            advantages: {
                  title: "Что дает оформление вида на жительство для иностранцев",
                  desc: "После получение ВНЖ иностранцам дается возможность оформить последний статус — это оформить Гражданство РФ. Нет необходимости уезжать с территории РФ. С видом на жительство иностранцы могут находиться на территории Российской Федерации практически неограниченное временя без выезда. Это очень удобно, нет необходимости приобретать билеты. С видом на жительство в РФ иностранный гражданин может работать где угодно, в любом регионе России. Можно смело говорить о том, что этот статус практически и есть гражданство с небольшими ограничениями.",
            },
            reasons: {
                  title: "Почему заказывают помощь в оформлении ВНЖ РФ у нас?",
                  desc: `Вид на жительство в Российской Федерации — это документ, который подтверждает право на постоянное проживание в России и дает возможность работать, учиться и получать медицинскую помощь на территории страны. Если вы планируете переехать в Россию или уже находитесь здесь, то получение вида на жительства может быть важным шагом для вашего будущего благополучия.
                        </br>
                        </br>
                        Наша компания предлагает полный спектр услуг по получению вида на жительство в России. Мы поможем вам собрать необходимые документы, заполнить заявления и подать их в соответствующие органы. Наши специалисты имеют большой опыт работы в данной сфере и готовы предоставить вам профессиональную консультацию по всем вопросам, связанным с получением вида на жительство.
                        </br>
                        </br>
                        Мы гарантируем быстрое и качественное выполнение всех необходимых процедур. Наша команда работает оперативно и эффективно, чтобы вы могли получить вид на жительство в кратчайшие сроки. Кроме того, мы предоставляем полную информационную поддержку на всех этапах процесса.
                        </br>
                        </br>
                        Если вы хотите получить вид на жительство и жить в России, обратитесь к нам. Мы готовы помочь вам в этом процессе и сделать его максимально комфортным и легким для вас. Обращайтесь к нам уже сегодня и получите вид на жительство, который откроет перед вами новые возможности и перспективы!
                        `,
            },
      },
      {
            id: 5,
            title: "Получение Гражданства РФ",
            price: "35.000 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Объективная оценка ваших перспектив в получении гражданства",
                  },
                  {
                        title: "Подготовка заявления по форме 2023 года на оформление гражданства в Москве или Мос.обл",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в МВД (ММЦ Сахарово или Мос.обл)",
                  },
                  {
                        title: "Результат:",
                        desc: "Через 4-5 месяцев вы становитесь полноценным гражданином РФ. 100% законно и официально!",
                  },
            ],

            advantages: {
                  title: "Что дает оформление гражданство РФ для иностранцев",
                  desc: "Получение гражданства РФ является заключительным этапом для иностранного гражданина, через 4-5 месяцев после подачи документов на гражданство РФ иностранный гражданин принимает присягу и получает паспорт гражданина РФ, при этом с недавних пор иностранным гражданам нет необходимости отказываться от предыдущего гражданства.",
            },
            reasons: {
                  title: "Почему заказывают помощь в оформлении гражданства РФ у нас?",
                  desc: `Вид на жительство в Российской Федерации — это документ, который подтверждает право на постоянное проживание в России и дает возможность работать, учиться и получать медицинскую помощь на территории страны. Если вы планируете переехать в Россию или уже находитесь здесь, то получение вида на жительства может быть важным шагом для вашего будущего благополучия.
                        </br>
                        </br>
                        Наша компания предлагает полный спектр услуг по получению вида на жительство в России. Мы поможем вам собрать необходимые документы, заполнить заявления и подать их в соответствующие органы. Наши специалисты имеют большой опыт работы в данной сфере и готовы предоставить вам профессиональную консультацию по всем вопросам, связанным с получением вида на жительство.
                        </br>
                        </br>
                        Мы гарантируем быстрое и качественное выполнение всех необходимых процедур. Наша команда работает оперативно и эффективно, чтобы вы могли получить вид на жительство в кратчайшие сроки. Кроме того, мы предоставляем полную информационную поддержку на всех этапах процесса.
                        </br>
                        </br>
                        Если вы хотите получить вид на жительство и жить в России, обратитесь к нам. Мы готовы помочь вам в этом процессе и сделать его максимально комфортным и легким для вас. Обращайтесь к нам уже сегодня и получите вид на жительство, который откроет перед вами новые возможности и перспективы!
                        `,
            },
      },
      {
            id: 6,
            title: "Получение статуса НРЯ",
            price: "15.000 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Объективная оценка ваших перспектив в получении НРЯ",
                  },
                  {
                        title: "Подготовка заявления по форме 2023 года на оформление НРЯ в Москве или Мос.обл",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в МВД (ММЦ Сахарово или Мос.обл)",
                  },
                  {
                        title: "Результат:",
                        desc: "Через 30 дней вы получаете статус НРЯ. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Что дает оформление рВП в РФ для иностранцев",
                  desc: "После получения РВП при желании есть возможность оформить в упрощенном порядке ВНЖ Российской Федерации. Нет необходимости уезжать с территории РФ. С РВП иностранцы могут находиться на территории Российской Федерации до трех лет без выезда. Это очень удобно, нет необходимости приобретать билеты. С РВП в РФ иностранный гражданин может работать без патента на работу. Это экономически выгодно.",
            },
            reasons: {
                  title: "Почему заказывают помощь в оформлении РВП РФ у нас?",
                  desc: `Хотите получить статус НРЯ (носитель русского языка) и жить в России без ограничений? Наша компания поможет вам в этом! Мы предоставляем полный спектр услуг по получению статуса НРЯ, начиная от консультации и заканчивая сопровождением всех необходимых процедур. У нас работают только проверенные эксперты и юристы, которые знают все тонкости получения статуса НРЯ. Мы гарантируем полную конфиденциальность и защиту ваших персональных данных. Наши услуги включают в себя:
                        <br /><br />
                        <span class="reasons__content-list--item">Консультация по всем вопросам, связанным с получением статуса НРЯ;</span>
                        <span class="reasons__content-list--item">Подготовка необходимых документов;</span>
                        <span class="reasons__content-list--item">Сопровождение всех процедур получения статуса;</span>
                        <span class="reasons__content-list--item">Помощь в решении любых проблем, связанных с получением статуса.</span>
                        <br />
                        Не упустите свой шанс получить статус НРЯ и жить в России на законных основаниях! Обратитесь к нам прямо сейчас и получите профессиональную помощь в получении статуса НРЯ!`,
            },
      },
      {
            id: 7,
            title: "Судебная защита иностранных граждан в Москве",
            price: "50.000 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Выяснение точных причин применения к вам санкций со стороны государства",
                  },
                  {
                        title: "Разработка стратегии защиты ваших интересов",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением для суда",
                  },
                  {
                        title: "Участие в суде наших специалистов для вашей защиты",
                  },
                  {
                        title: "Результат:",
                        desc: "Мы сможем отменить решения о выдворении и депортации с территории РФ.",
                  },
            ],
            advantages: {
                  title: "Что дает юридическая защита иностранцев в Москве?",
                  desc: "Судебная защита иностранцев — это необходимый элемент для обеспечения их прав и свобод. Иностранцы, как и граждане своей страны, имеют право на защиту своих прав и интересов в суде. Судебная защита необходима для того, чтобы обеспечить справедливое рассмотрение дела и защитить права иностранцев, которые могут быть нарушены во время судебного процесса. Это особенно важно в случае, если иностранец находится в другой стране и не может защитить свои права на территории РФ. Кроме того, судебная защита позволяет иностранцам получить доступ к правосудию и обеспечить свои права в соответствии с международными нормами и стандартами. Это важно для того, чтобы избежать дискриминации и обеспечить равные возможности для всех граждан независимо от их гражданства.",
            },
            reasons: {
                  title: "Почему заказывают помощь юристов в суде для иностранцев?",
                  desc: `Хотите защитить свои права и интересы, но вы иностранец в Москве? Не знаете, как это сделать? Тогда наша услуга судебной защиты иностранцев — именно то, что вам нужно! Мы предлагаем профессиональную юридическую помощь для защиты ваших прав в суде. Наши специалисты имеют большой опыт работы с иностранными гражданами и знают все нюансы законодательства. Наша услуга включает в себя следующие виды услуг:
                        <br /><br />
                        <span class="reasons__content-list--item">Консультация по вопросам судебного процесса и защита ваших интересов в суде;</span>
                        <span class="reasons__content-list--item">Подготовка документов для подачи иска в суд;</span>
                        <span class="reasons__content-list--item">Представление интересов в суде на всех этапах процесса;</span>
                        <span class="reasons__content-list--item">Помощь в получении необходимых документов и разрешений на ведение судебного процесса.</span>
                        <br />
                        Наши услуги доступны для всех иностранных граждан, которые находятся в Москве или за пределами РФ и имеют проблемы с законом (были подвергнуты депортации или выдворению). Мы гарантируем конфиденциальность и высокое качество нашей работы. Не откладывайте защиту своих прав на потом! Обратитесь к нам уже сегодня и получите квалифицированную юридическую помощь!`,
            },
      },
      {
            id: 8,
            title: "ИНН для иностранных граждан",
            price: "8.000 ₽",
            cards: [
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в необходимые инстанции ИФНС",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении 5 дней вы получаете ИНН для иностранцев. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Что дает получение ИНН для иностранцев?",
                  desc: "Получение ИНН иностранными гражданами Идентификационного Номера Налогоплательщика (ИНН) РФ подтверждает их становление налоговыми резидентами страны. Это в свою очередь позволяет им получить доступ к государственным услугам, возможности оформить кредиты или открыть свой бизнес. Если вы являетесь работодателям, в штате предприятия которого состоят иностранцы, то оформление для них ИНН даст вам возможность полностью узаконить и упростить финансовые расчеты.",
            },
            reasons: {
                  title: "Почему заказывают помощь в оформлении ИНН для иностранцев у нас?",
                  desc: `Хотите получить ИНН, но не знаете, как это сделать? Наша компания готова помочь вам! Мы предоставляем услуги по получению ИНН для иностранных граждан. Мы понимаем, что получение ИНН может быть сложным и длительным процессом, особенно для тех, кто не знаком с местными правилами и процедурами. Поэтому мы предлагаем вам профессиональную помощь в получении ИНН. Наша команда состоит из опытных специалистов, которые знают все тонкости. Мы поможем вам собрать все необходимые документы, заполнить заявления и подать их в соответствующие органы. Кроме того, мы гарантируем конфиденциальность и безопасность ваших персональных данных. Мы не передаем их третьим лицам и не используем их для каких-либо целей, кроме помощи в получении ИНН. Обратитесь к нам уже сегодня и получите помощь в получении ИНН для мигрантов. Мы гарантируем быстрый и качественный результат!`,
            },
      },
      {
            id: 10,
            title: "Восстановление просроченных документов иностранцам",
            price: "5.000 ₽",
            cards: [
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в необходимые инстанции",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении максимум 30 дней вы получаете необходимые документы. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Почему заказывают помощь в восстановлении просроченных документов для иностранцев у нас?",
                  desc: "Если у иностранного гражданина вышел срок каких-либо документов, и он не предпринимает никаких действий по их восстановлению, то это по закону расценивается как нарушение миграционного законодательства РФ. Для самого иностранного гражданина это грозит выдворением или депортацией, а также денежным штрафом. Если же иностранный гражданин числится сотрудником какой-либо компании, то ей грозит штраф, накладываемый как на само юр лицо, так и на ответственных лиц. Чтобы избежать этого требуется всего лишь отслеживать сроки выданных государством разрешений и документов и вовремя восстанавливать их.",
            },
            reasons: {
                  title: "Почему заказывают помощь в оформлении СНИЛС для иностранных граждан у нас?",
                  desc: `Вы иностранец и хотите восстановить просроченные документы? Мы можем помочь вам! Наша компания предоставляет услуги по восстановлению документов, включая паспорта, визы, разрешения и другие важные бумаги. Мы работаем с иностранцами, которые столкнулись с проблемами с документами, и готовы помочь им восстановить их. Наши специалисты имеют большой опыт работы в этой области и знают, как правильно оформить запросы и заявления и в какие инстанции их подавать. Кроме того, мы предлагаем доступные цены на наши услуги и гарантируем быстрое и качественное выполнение работы. Если у вас есть просроченные документы, не откладывайте их восстановление на потом, обратитесь к нам уже сегодня и получите помощь в кратчайшие сроки! Так как истечение срока документов может иметь для вас серьезные последствия вплоть до экстрадиции или выдворения, а также штрафов на организацию и ответственных лиц, если документы будут просрочены у ваших работников.`,
            },
      },
      {
            id: 11,
            title: "Подача запросов от иностранных граждан",
            price: "15.000 ₽",
            cards: [
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в необходимые инстанции для оформления запроса",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении максимум 30 дней вы получаете заверенный ответ по вашему запросу. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Для чего подаются запросы от иностранных граждан в государственные структуры РФ?",
                  desc: "Запросы от иностранных граждан выполняются в ГУ МВД и Архивы РФ с целью получения информации, способной помочь иностранному гражданину в подтверждении своего статуса на территории России. Например, установить и подтвердить наличие близких родственников, благодаря которым иностранец может рассчитывать получить один из официальных статусов. Также благодаря этим запросам можно выяснить причины наложения штрафных санкций и ограничений (например, выдворение или депортация), чтобы юристы могли их оспорить.",
            },
            reasons: {
                  title: "Почему заказывают подачу запросов в Архивы РФ и ГУ МВД у нас?",
                  desc: `Важно помнить, что запрос может быть отправлен только в том случае, если он соответствует требованиям законодательства и не нарушает права других лиц. Если у вас есть сомнения в законности запроса, лучше обратиться к юристу за консультацией. Поэтому без должной юридической поддержки велик шанс получить отказ в предоставлении информации. Наши юристы отлично знают законы и смогут получить интересующую вас информацию, правильно составив запрос и отправив его именно в нужные инстанции. В связи с этим вы не потратите в пустую время!`,
            },
      },
      {
            id: 12,
            title: "Подготовка трудового договора с иностранцами",
            price: "500 ₽",
            cards: [
                  {
                        title: "Подготовим договор и поможем собрать необходимые документы для уведомления по его заключению",
                  },
                  {
                        title: "Организуем сдачу документов в ОВМ МВД",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении одного дня будет подготовлен договор, при желании можем помочь с уведомлением ОВМ МВД. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Для чего в обязательном порядке заключать трудовой договор с иностранцем?",
                  desc: `Составить трудовой договор с иностранцем не слишком просто, так как есть два варианта оформления.
                        <br /><br />
                        1. Это составить трудовой договор — этот договор составляется для иностранных граждан, которых принимают в штат компании, с оформлением трудовой книжки, должностных инструкций, правилами внутреннего трудового распорядка, отпусками и тд.</br>
                        2. Составить договор ГПХ — главным отличием является отсутствие необходимости брать иностранного гражданина в штат, по сути ГПХ — это договор подряда на выполнение определенных видов работ.</br>
                        <br />
                        ВАЖНО! Независимо от вида договора, работодатель обязан в 3-х дневный срок подать уведомление о заключении трудового договора с иностранным гражданином в МВД!`,
            },
            reasons: {
                  title: "Почему заказывают подачу запросов в Архивы РФ и ГУ МВД у нас?",
                  desc: `Доверьте составление трудового договора / ГПХ нашим миграционным юристам, так как при составлении договора необходимо учесть следующие моменты:
                        <br /><br />
                        1. Должность — существуют ограничения по некоторым должностям, их перечень утверждает Правительство;</br>
                        2. Место работы — по этому адресу производиться уведомление МВД;</br>
                        3. Оплата труда — есть определенный минимум, ниже которого опускаться нельзя;</br>
                        4. Условия труда и оплаты — если не учесть, то возможны проверки со стороны трудовой инспекции с вытекающими последствиями в виде штрафов.</br>
                        <br />
                        Таким образом, составление договора для иностранного гражданина должно быть тщательно проработано и грамотно составлено для избежания проблем в будущем. Помимо составления договора наши специалисты проверят при трудоустройстве легальность документов иностранных граждан.`,
            },
      },
      {
            id: 13,
            title: "Уведомление о приеме на работу иностранцев",
            price: "4 000 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Вы можете заказать только пакет документов или оформление нашим сотрудником",
                  },
                  {
                        title: "Подготовка заявления по форме 2025 года",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в ОВМ МВД",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении одного дня будет подготовлен договор, при желании можем помочь с уведомлением ОВМ МВД. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Уведомление о приеме иностранного гражданина",
                  desc: `Уведомление о приеме иностранного гражданина — это обязательная процедура для работодателей, принимающих на работу иностранных работников. Согласно законодательству, работодатель обязан подать уведомление в МВД о приеме на работу иностранца в установленные сроки. Это уведомление необходимо для соблюдения миграционного законодательства и предотвращения возможных штрафов.
                        </br><br />
                        <b>Почему важно подать уведомление о приеме иностранного гражданина?</b>
                        <br />
                        1. Соблюдение закона: Уведомление в МВД о приеме на работу иностранца является обязательным требованием, несоблюдение которого может привести к административным штрафам.</br>
                        2. Легализация работы: Уведомление подтверждает легальность трудоустройства иностранного гражданина и защищает интересы как работодателя, так и работника.</br>
                        3. Контроль за миграцией: Уведомление помогает государству контролировать миграционные потоки и обеспечивать безопасность.</br>
                        <br />
                        ВАЖНО! Независимо от вида договора, работодатель обязан в 3-х дневный срок подать уведомление о заключении трудового договора с иностранным гражданином в МВД!`,
            },
            reasons: {
                  title: "Почему заказывают уведомление ОВМ МВД о приеме иностранных граждан у нас?",
                  desc: `
                        Как подать уведомление о приеме иностранного гражданина?
                        <br />
                        1. Подготовка документов: Соберите все необходимые документы, включая паспорт иностранного гражданина, трудовой договор и разрешение на работу.</br>
                        2. Заполнение формы: Заполните форму уведомления, указав все требуемые данные.</br>
                        3. Подача уведомления: Подайте уведомление в территориальное подразделение МВД в установленные сроки.</br>
                        4. Сроки подачи. уведомления Уведомление о приеме иностранного гражданина должно быть подано в течение 3 рабочих дней с момента заключения трудового договора. Несоблюдение сроков может привести к штрафам.
                        </br></br>
                        Какие документы нужны для подачи уведомления?
                        <br />
                        1. Подготовка документов: Соберите все необходимые документы, включая паспорт иностранного гражданина, трудовой договор и разрешение на работу.</br>
                        2. Заполнение формы: Заполните форму уведомления, указав все требуемые данные.</br>
                        3. Подача уведомления: Подайте уведомление в территориальное подразделение МВД в установленные сроки.</br>
                        4. Сроки подачи. уведомления Уведомление о приеме иностранного гражданина должно быть подано в течение 3 рабочих дней с момента заключения трудового договора. Несоблюдение сроков может привести к штрафам.
                        </br></br>
                        Почему стоит доверить подачу уведомления профессионалам?
                        <br />
                        1. Опыт и знания: Специалисты знают все нюансы и требования законодательства.</br>
                        2. Снижение рисков: Профессиональная помощь минимизирует риск ошибок и штрафов.</br>
                        3. Экономия времени: Профессионалы быстро и качественно подготовят и подадут уведомление.</br>
                        <br />
                        <b>Уведомление о приеме иностранного гражданина</b> — это важная процедура, которая требует внимательного подхода. Соблюдение всех требований и сроков поможет избежать проблем и обеспечит легальность трудоустройства иностранного работника. Если у вас возникли вопросы или нужна помощь в подаче уведомления, обратитесь к профессионалам.`,
            },
      },
      {
            id: 14,
            title: "Регистрация иностранцев в РФ",
            price: "100 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Объективная оценка перспектив в получении регистрации по месту пребывания",
                  },
                  {
                        title: "Подготовка заявления по форме 2023 года на регистрацию иностранца в Москве или Мос.обл",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в ГосУслугах / ОВМ МВД",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении 5 дней вы получаете документы о регистрации. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Для чего нужно регистрировать иностранных граждан?",
                  desc: `Регистрация иностранного гражданина по месту жительства включает в себя фиксацию адреса конкретного жилого помещения в виде на жительство или в разрешении на временное проживание указанного иностранного гражданина, а также в учетных документах органа миграционного учета и в государственной информационной системе миграционного учета. Если вы принимаете на работу иностранного гражданина, то наличие у него регистрации — обязательное условие. Нарушение Федеральных Законов № 109 и № 163 имеет последствия не только для самого иностранца, но и для лиц, размещающих его у себя (сдающих жилье в аренду) и предоставляющих ему работу.`,
            },
            reasons: {
                  title: "Почему заказывают помощь в регистрации иностранцев у нас?",
                  desc: `Хотите зарегистрировать иностранного гражданина по месту пребывания в Москве? Наша компания предлагает вам профессиональную помощь в этом процессе. Мы гарантируем быструю и надежную регистрацию, а также полное соблюдение всех необходимых требований и правил. Наши специалисты имеют большой опыт работы в данной сфере и знают все тонкости процесса регистрации иностранных граждан. Они помогут вам подготовить все необходимые документы, заполнить заявления и подать их в соответствующие органы. Кроме того, мы предлагаем индивидуальный подход к каждому клиенту и готовы учесть все ваши пожелания и требования. Наша компания гарантирует конфиденциальность и безопасность ваших данных.`,
            },
      },
      {
            id: 15,
            title: "Судебная защита работодателей при нарушении миграционного законов",
            price: "50.000 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Оценка перспектив вашего дела",
                  },
                  {
                        title: "Подготовка доказательной базы об отсутствии нарушений закона с вашей стороны",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Участие наших юристов в судебных заседаниях любых инстанций",
                  },
                  {
                        title: "Результат:",
                        desc: "Поможем вам или вашей организации избежать штрафов за нарушения. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Какие последствия бывают при нарушении миграционного законодательства?",
                  desc: `Регистрация иностранного гражданина по месту жительства включает в себя фиксацию адреса конкретного жилого помещения в виде на жительство или в разрешении на временное проживание указанного иностранного гражданина, а также в учетных документах органа миграционного учета и в государственной информационной системе миграционного учета. Если вы принимаете на работу иностранного гражданина, то наличие у него регистрации — обязательное условие. Нарушение Федеральных Законов № 109 и № 163 имеет последствия не только для самого иностранца, но и для лиц, размещающих его у себя (сдающих жилье в аренду) и предоставляющих ему работу.`,
            },
            reasons: {
                  title: "Почему заказывают помощь в регистрации иностранцев у нас?",
                  desc: `
                        За нарушение правил осуществления миграционного учета иностранных граждан и лиц без гражданства, а так же неуведомления либо несвоевременного уведомления о привлечении / увольнения к труду работодателем в Российской Федерации, утвержденных Постановлением Правительства Российской Федерации от 15 января 2007 года № 9, а так же ФЗ-109 и ФЗ-115, Приказа МВД РФ № 363 от 04.06.2019 года, Приказа МВД России от 30.07.2020 N 536 в соответствии со ст. 18.8, 18.9, и 19.27 КоАП РФ предусмотрена административная ответственность в виде штрафа (за каждого привлекаемого) в размере:
                        <br /><br />
                        на иностранных граждан – от 2000 до 5000 рублей;<br />
                        на должностных лиц – от 40000 до 50000 рублей;<br />
                        на юридических лиц – от 250000 до 1 000000 рублей;
                        <br /><br />
                        1. Проверка бывает 2х видов:<br />
                        — Плановая проверка (1 раз в 3 года, особенно это касается малого бизнеса);<br />
                        — Внеплановая проверка (данная проверка может осуществляться по заявлению других лиц, жалобам и т.д.)</br></br>
                        2. Какие документы запрашивают сотрудники ОВМ МВД (УФМС) при проверке?</br>
                        — Патент на работу</br>
                        — Трудовой договор</br>
                        — Уведомление ОВМ МВД (УФМС)</br>
                        — Паспорт иностранного гражданина</br>
                        — Миграционную карту иностранного гражданина</br>
                        — Регистрацию иностранного гражданина (уведомление в место прибытия)</br>
                        — В случае если выяснится, что некоторые работники были уволены на момент проведения проверки, то так же потребуется предоставить уведомления  (уведомление ОВМ ГУ МВД России по г. Москва) об их увольнении.</br></br>
                        3. В случае не предоставление хотя бы одного из вышеперечисленного документа Вы подлежите административной ответственности, при этом не важно кто Вы — Индивидуальный предприниматель или Юридическое лицо, так же следует отметить, что административная ответственность наступает в за каждого незаконно привлекаемого иностранного гражданина либо некорректно оформленного сотрудника.</br>
                        `,
            },
      },
      {
            id: 16,
            title: "Аудит предприятия по миграционному законодательству",
            price: "10.000 ₽",
            cards: [
                  {
                        title: "Полная проверка документов иностранцев и предприятия на соответствие законам РФ",
                  },
                  {
                        title: "Рекомендации и помощь в устранении выявленных нарушений",
                  },
                  {
                        title: "Результат:",
                        desc: "Мы сможем отменить решения о выдворении и депортации с территории РФ.",
                  },
            ],
            advantages: {
                  title: "Для чего нужен миграционный аудит организации?",
                  desc: "Необходимость проведения кадрового миграционного аудита возникает у многих предприятий, нанимающих иностранных граждан. В связи с тем что по миграционным законам как сам иностранец, так и работодатель должны подготовить и иметь на руках множество документов, каждый из которых имеет свой срок действия, кадровые отделы часто могут ошибиться или забыть об одном из обязательных требований. А любое даже самое незначительное нарушение неминуемо приведет к плачевным последствиям в виде огромных штрафов (штраф до 1 00 000 за каждое нарушение) при первой же проверке МВД. Миграционный аудит Вашей компании нашими миграционными юристами упорядочит документооборот иностранных сотрудников, что позволит избежать огромных штрафов.",
            },
            reasons: {
                  title: "Почему заказывают миграционный аудит документов кадрового отдела компании у нас?",
                  desc: `Как производиться кадровый миграционный аудит Вашей компании?
                        <br /><br />
                        <span class="reasons__content-list--item">После согласования сроков проведения аудита наш миграционный юрист приезжает к Вам и начинает проверку кадровой документации по которым были приняты иностранные граждане.</span>
                        <span class="reasons__content-list--item">Проверка осуществляется по следующим критериям:</span>
                        1. Проверка наличия миграционных карт, регистраций и патентов на работу (сроки и их легальность);<br />
                        2. Проверка трудовых договоров / ГПХ — на предмет соответствия трудовому законодательству;<br />
                        3. Проверка уведомлений о привлечении иностранных граждан к труду либо увольнения.<br />
                        <span class="reasons__content-list--item">По результатам миграционного аудита наш юрист предоставляет отчет по выявленным нарушениям, а так же пути их решения (легализация, внесения изменений в кадровую документацию, переоформление иностранных граждан и тд.).</span>
                        <br />
                        Наши услуги доступны для всех иностранных граждан, которые находятся в Москве или за пределами РФ и имеют проблемы с законом (были подвергнуты депортации или выдворению). Мы гарантируем конфиденциальность и высокое качество нашей работы. Не откладывайте защиту своих прав на потом! Обратитесь к нам уже сегодня и получите квалифицированную юридическую помощь!`,
            },
      },
      {
            id: 17,
            title: "ИНН для иностранных граждан",
            price: "8.000 ₽",
            cards: [
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в необходимые инстанции ИФНС",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении 5 дней вы получаете ИНН для иностранцев. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Что дает получение ИНН для иностранцев?",
                  desc: "Получение ИНН иностранными гражданами Идентификационного Номера Налогоплательщика (ИНН) РФ подтверждает их становление налоговыми резидентами страны. Это в свою очередь позволяет им получить доступ к государственным услугам, возможности оформить кредиты или открыть свой бизнес. Если вы являетесь работодателям, в штате предприятия которого состоят иностранцы, то оформление для них ИНН даст вам возможность полностью узаконить и упростить финансовые расчеты.",
            },
            reasons: {
                  title: "Почему заказывают помощь в оформлении ИНН для иностранцев у нас?",
                  desc: `Хотите получить ИНН, но не знаете, как это сделать? Наша компания готова помочь вам! Мы предоставляем услуги по получению ИНН для иностранных граждан. Мы понимаем, что получение ИНН может быть сложным и длительным процессом, особенно для тех, кто не знаком с местными правилами и процедурами. Поэтому мы предлагаем вам профессиональную помощь в получении ИНН. Наша команда состоит из опытных специалистов, которые знают все тонкости. Мы поможем вам собрать все необходимые документы, заполнить заявления и подать их в соответствующие органы. Кроме того, мы гарантируем конфиденциальность и безопасность ваших персональных данных. Мы не передаем их третьим лицам и не используем их для каких-либо целей, кроме помощи в получении ИНН. Обратитесь к нам уже сегодня и получите помощь в получении ИНН для мигрантов. Мы гарантируем быстрый и качественный результат!`,
            },
      },
      {
            id: 18,
            title: "Получение СНИЛС для иностранца в РФ",
            price: "8.000 ₽",
            cards: [
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в необходимые инстанции ПФР",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении 5 дней СНИЛС для иностранного гражданина будет готов. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Что дает СНИЛС для иностранных граждан?",
                  desc: "Получение СНИЛС для иностранного гражданина является обязательным, если он хочет патент на осуществление трудовой деятельности на территории РФ. Также без его оформления работодатель не сможет делать страховые отчисления для иностранного гражданина. И еще один момент — только с ним и при наличии полиса ОМС иностранцы могут получать бесплатное медицинское обслуживание. Если вы иностранный гражданин, планирующий работать и жить в России, то оформление СНИЛС является для вас обязательной задачей. Если вы работодатель, принимающий на работу иностранцев, не имеющих полного пакета документов, то проще всего вам централизованно решить вопросы для всех сразу (в том числе и заказать получение ими СНИЛС).",
            },
            reasons: {
                  title: "Почему заказывают помощь в оформлении СНИЛС для иностранных граждан у нас?",
                  desc: `Хотите оформить СНИЛС для вашего иностранного сотрудника или для себя? Мы предлагаем вам профессиональную помощь в этом процессе! Наши специалисты помогут вам подготовить все необходимые документы, заполнить заявление на получение СНИЛС, а также предоставят консультации по всем вопросам, связанным с процедурой оформления. Мы гарантируем быстрое и качественное оформление СНИЛС, что позволит вам или вашему сотруднику получить доступ к социальным услугам и пенсионным отчислениям. Не откладывайте оформление СНИЛС на потом – обратитесь к нам уже сегодня и получите профессиональную помощь от наших специалистов!`,
            },
      },
      // 19 page is not started yet
      {
            id: 20,
            title: "Подготовка трудового договора с иностранцами",
            price: "500 ₽",
            cards: [
                  {
                        title: "Подготовим договор и поможем собрать необходимые документы для уведомления по его заключению",
                  },
                  {
                        title: "Организуем сдачу документов в ОВМ МВД",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении одного дня будет подготовлен договор, при желании можем помочь с уведомлением ОВМ МВД. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Для чего в обязательном порядке заключать трудовой договор с иностранцем?",
                  desc: `Составить трудовой договор с иностранцем не слишком просто, так как есть два варианта оформления.<br />
                        1. Это составить трудовой договор — этот договор составляется для иностранных граждан, которых принимают в штат компании, с оформлением трудовой книжки, должностных инструкций, правилами внутреннего трудового распорядка, отпусками и тд.</br>
                        2. Составить договор ГПХ — главным отличием является отсутствие необходимости брать иностранного гражданина в штат, по сути ГПХ — это договор подряда на выполнение определенных видов работ.</br>
                        <br />
                        ВАЖНО! Независимо от вида договора, работодатель обязан в 3-х дневный срок подать уведомление о заключении трудового договора с иностранным гражданином в МВД!`,
            },
            reasons: {
                  title: "Почему заказывают помощь в подготовке трудового договора / договора ГПХ у нас?",
                  desc: `
                        Доверьте составление трудового договора / ГПХ нашим миграционным юристам, так как при составлении договора необходимо учесть следующие моменты:
                        <br />
                        1. Должность — существуют ограничения по некоторым должностям, их перечень утверждает Правительство;</br>
                        2. Место работы — по этому адресу производиться уведомление МВД;</br>
                        3. Оплата труда — есть определенный минимум, ниже которого опускаться нельзя;</br>
                        4. Условия труда и оплаты — если не учесть, то возможны проверки со стороны трудовой инспекции с вытекающими последствиями в виде штрафов.
                        Таким образом, составление договора для иностранного гражданина должно быть тщательно проработано и грамотно составлено для избежания проблем в будущем. Помимо составления договора наши специалисты проверят при трудоустройстве легальность документов иностранных граждан.`,
            },
      },
      {
            id: 21,
            title: "Регистрация иностранцев в РФ",
            price: "100 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Объективная оценка перспектив в получении регистрации по месту пребывания",
                  },
                  {
                        title: "Подготовка заявления по форме 2023 года на регистрацию иностранца в Москве или Мос.обл",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в ГосУслугах / ОВМ МВД",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении 5 дней вы получаете документы о регистрации. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Для чего нужно регистрировать иностранных граждан?",
                  desc: `Регистрация иностранного гражданина по месту жительства включает в себя фиксацию адреса конкретного жилого помещения в виде на жительство или в разрешении на временное проживание указанного иностранного гражданина, а также в учетных документах органа миграционного учета и в государственной информационной системе миграционного учета. Если вы принимаете на работу иностранного гражданина, то наличие у него регистрации — обязательное условие. Нарушение Федеральных Законов № 109 и № 163 имеет последствия не только для самого иностранца, но и для лиц, размещающих его у себя (сдающих жилье в аренду) и предоставляющих ему работу.`,
            },
            reasons: {
                  title: "Почему заказывают помощь в регистрации иностранцев у нас?",
                  desc: `Хотите зарегистрировать иностранного гражданина по месту пребывания в Москве? Наша компания предлагает вам профессиональную помощь в этом процессе. Мы гарантируем быструю и надежную регистрацию, а также полное соблюдение всех необходимых требований и правил. Наши специалисты имеют большой опыт работы в данной сфере и знают все тонкости процесса регистрации иностранных граждан. Они помогут вам подготовить все необходимые документы, заполнить заявления и подать их в соответствующие органы. Кроме того, мы предлагаем индивидуальный подход к каждому клиенту и готовы учесть все ваши пожелания и требования. Наша компания гарантирует конфиденциальность и безопасность ваших данны .`,
            },
      },
      {
            id: 22,
            title: "Уведомление о приеме на работу иностранцев",
            price: "4 000 ₽",
            cards: [
                  {
                        title: "Подробная консультация по миграционному законодательству РФ",
                  },
                  {
                        title: "Вы можете заказать только пакет документов или оформление нашим сотрудником",
                  },
                  {
                        title: "Подготовка заявления по форме 2025 года",
                  },
                  {
                        title: "Сбор нами всего пакета документов с нотариальным заверением за 1 день",
                  },
                  {
                        title: "Организуем сдачу документов в ОВМ МВД",
                  },
                  {
                        title: "Результат:",
                        desc: "В течении недели уведомление будет принято в МВД. 100% законно и официально!",
                  },
            ],
            advantages: {
                  title: "Уведомление о приеме иностранного гражданина",
                  desc: `Уведомление о приеме иностранного гражданина — это обязательная процедура для работодателей, принимающих на работу иностранных работников. Согласно законодательству, работодатель обязан подать уведомление в МВД о приеме на работу иностранца в установленные сроки. Это уведомление необходимо для соблюдения миграционного законодательства и предотвращения возможных штрафов.
                        </br><br />
                        <b>Почему важно подать уведомление о приеме иностранного гражданина?</b>
                        <br />
                        1. Соблюдение закона: Уведомление в МВД о приеме на работу иностранца является обязательным требованием, несоблюдение которого может привести к административным штрафам.</br>
                        2. Легализация работы: Уведомление подтверждает легальность трудоустройства иностранного гражданина и защищает интересы как работодателя, так и работника.</br>
                        3. Контроль за миграцией: Уведомление помогает государству контролировать миграционные потоки и обеспечивать безопасность.</br>
                        <br />`,
            },
            reasons: {
                  title: "Почему заказывают уведомление ОВМ МВД о приеме иностранных граждан у нас?",
                  desc: `
                        Как подать уведомление о приеме иностранного гражданина?
                        <br />
                        1. Подготовка документов: Соберите все необходимые документы, включая паспорт иностранного гражданина, трудовой договор и разрешение на работу.</br>
                        2. Заполнение формы: Заполните форму уведомления, указав все требуемые данные.</br>
                        3. Подача уведомления: Подайте уведомление в территориальное подразделение МВД в установленные сроки.</br>
                        4. Сроки подачи. уведомления Уведомление о приеме иностранного гражданина должно быть подано в течение 3 рабочих дней с момента заключения трудового договора. Несоблюдение сроков может привести к штрафам.
                        </br></br>
                        Какие документы нужны для подачи уведомления?
                        <br />
                        1. Паспорт иностранного гражданина</br>
                        2. Трудовой договор</br>
                        3. Разрешение на работу (если требуется)</br>
                        4. Копия уведомления о приеме на работу
                        </br></br>
                        Почему стоит доверить подачу уведомления профессионалам?
                        <br />
                        1. Опыт и знания: Специалисты знают все нюансы и требования законодательства.</br>
                        2. Снижение рисков: Профессиональная помощь минимизирует риск ошибок и штрафов.</br>
                        3. Экономия времени: Профессионалы быстро и качественно подготовят и подадут уведомление.</br>
                        <br />
                        <b>Уведомление о приеме иностранного гражданина</b> — это важная процедура, которая требует внимательного подхода. Соблюдение всех требований и сроков поможет избежать проблем и обеспечит легальность трудоустройства иностранного работника. Если у вас возникли вопросы или нужна помощь в подаче уведомления, обратитесь к профессионалам.`,
            },
      },
]);

const paramsId = ref(Number(route.params.id));

const filteredService = ref({
      id: null,
      title: "",
      cards: null,

      advantages: null,
      reasons: null,
});

const serviceFunc = () => {
      const filterData = service.value.find((item) => item.id === Number(paramsId.value));

      if (filterData) {
            filteredService.value = {
                  id: filterData.id,
                  title: filterData.title,
                  price: filterData.price,
                  cards: filterData.cards,
                  advantages: filterData.advantages,
                  reasons: filterData.reasons,
            };
      } else {
            filteredService.value = { id: null, title: "Не найдено", desc: "" };
      }
};

watch(
      () => route.params.id,
      (newVal) => {
            paramsId.value = Number(newVal);
            serviceFunc();
      },
      { immediate: true }
);
</script>

<template>
      <main>
            <!-- breadcrumb esdan chiqmasin  -->
            <Service class="pt-124" :title="filteredService.title" :price="filteredService.price" :cards="filteredService.cards" />
            <Advantages :advantages="filteredService.advantages" />
            <Reasons :reasons="filteredService.reasons" />
            <Faq :title="{ blue: 'Ответы на частые вопросы' }" />
            <section>
                  <BannerSecond />
            </section>
            <Reviews />
            <Location />
      </main>
</template>

<style scoped></style>
