<script setup></script>

<template>
      <section class="advantages">
            <div class="container">
                  <div class="advantages__top section__top">
                        <h2 class="advantages__top-title section__top-title">Что дает <span>юридическая защита иностранцев в Москве?</span></h2>
                  </div>
                  <div class="advantages__info">
                        <p class="advantages__info-desc">Судебная защита иностранцев — это необходимый элемент для обеспечения их прав и свобод. Иностранцы, как и граждане своей страны, имеют право на защиту своих прав и интересов в суде. Судебная защита необходима для того, чтобы обеспечить справедливое рассмотрение дела и защитить права иностранцев, которые могут быть нарушены во время судебного процесса. Это особенно важно в случае, если иностранец находится в другой стране и не может защитить свои права на территории РФ. Кроме того, судебная защита позволяет иностранцам получить доступ к правосудию и обеспечить свои права в соответствии с международными нормами и стандартами. Это важно для того, чтобы избежать дискриминации и обеспечить равные возможности для всех граждан независимо от их гражданства.</p>
                  </div>
            </div>
      </section>
</template>

<style>
.advantages__top-title {
      max-width: 673px;
}
</style>
