<script setup>
import BreadCrumb from "@/components/BreadCrumb.vue";
import Consult from "@/components/Consult.vue";

import { ref, watch } from "vue";
import { useRoute } from "vue-router";

const route = useRoute();

const articles = ref([
      {
            id: 1,
            title: "Уведомление о приеме иностранного гражданина",
            desc: [
                  {
                        type: "p",
                        text: "Правительство РФ утвердило новые правила экзаменов, необходимых для получения гражданства, которые прописывают алгоритм сдачи иностранцами тестов по русскому языку и по истории и национальному законодательству. Соответствующее постановление кабмина опубликовано на портале нормативных и правовых актов.",
                  },
                  {
                        type: "h2",
                        text: "Что такое уведомление о приеме иностранного?",
                  },
                  {
                        type: "p",
                        text: "Уведомление о приеме иностранного — это официальное сообщение Федеральной миграционной службе (ГУВМ МВД России) о факте трудоустройства работника, имеющего иностранное гражданство. Отправляется оно обязательно в письменном виде и должно включать полную информацию о сотруднике и работодателе.",
                  },
                  {
                        type: "h2",
                        text: "Какие бывают уведомления?",
                  },
                  {
                        type: "p",
                        text: `Существует несколько видов уведомлений, зависящих от статуса иностранца:
                              <span>Уведомление о приеме иностранного гражданина — отправляется при официальном найме на работу и заключения трудового договора.</span>
                              <span>Уведомление об увольнении иностранного гражданина — подается в случаях увольнения с работы.</span>
                              Каждый вид уведомления имеет собственную форму и отличается особенностями заполнения. Специалисты нашей компании помогут разобраться, какое именно уведомление необходимо в вашем конкретном случае.`,
                  },
                  {
                        type: "h2",
                        text: `Необходимость отправки уведомления`,
                  },
                  {
                        type: "p",
                        text: `Почему так важна правильная подача уведомления? Отсутствие подтверждения приема на работу грозит работодателю серьезными санкциями вплоть до значительных штрафов и запрета на прием иностранных работников. Только правильное заполнение документации обеспечит спокойную деятельность предприятия и избавит от неприятностей.`,
                  },
                  {
                        type: "h2",
                        text: `Процедура оформления`,
                  },
                  {
                        type: "p",
                        text: `Процедура выглядит следующим образом:<br/>
                              1. Работодатель собирает необходимую документацию.<br/>
                              2. Производится регистрация уведомления в ГУВМ МВД России.<br/>
                              3. В установленный срок отправляются данные о приеме иностранца.<br/>
                              Каждое действие должно соответствовать действующему законодательству, иначе возможны негативные последствия для работодателя.`,
                  },
                  {
                        type: "h2",
                        text: `Как мы помогаем работодателям?`,
                  },
                  {
                        type: "p",
                        text: `Компания оказывает помощь в профессиональном сопровождении всей процедуры приема иностранных граждан на работу. Среди наших услуг:
                              <span>Подготовка и подача правильного уведомления о приеме иностранного гражданина.</span>
                              <span>Консультационная поддержка по вопросам трудового законодательства.</span>
                              <span>Сокращение временных издержек и избежание ненужных проверок и штрафов.</span>
                              Таким образом, обратившись к специалистам, вы избежите распространенных ошибок и обеспечите себе спокойствие и уверенность в соблюдении миграционного законодательства.`,
                  },
            ],
      },
      {
            id: 2,
            title: "Экспериментальный учет мигрантов",
            desc: [
                  {
                        type: "p",
                        text: `В столице и Подмосковье начинается новый подход к учету иностранных граждан, который будет осуществляться не по месту их временного пребывания, а по адресу уполномоченной организации.
                              <br/><br/>
                              С 1 сентября 2025 года этот эксперимент будет распространяться на иностранцев, которые прибыли в Россию без визы для трудовой деятельности. А с 1 сентября 2026 года нововведение коснется тех, кто приехал в страну в безвизовом порядке на срок более 90 дней, но не для работы.
                              <br/><br/>
                              📱 Иностранным гражданам необходимо будет зарегистрироваться в специальном мобильном приложении, через которое они должны будут информировать МВД об изменениях в своем местонахождении в течение трех рабочих дней. Если геолокация на мобильном устройстве мигранта не будет активна в течение трех дней, его учет будет аннулирован.
                              <br/><br/>
                              ⚠️ Иностранцы, которые уже находятся на учете до 1 сентября 2025 года, должны будут обратиться в уполномоченную организацию для новой регистрации в течение 30 рабочих дней после окончания их учета по месту пребывания. Остальные мигранты обязаны будут зарегистрироваться по адресу уполномоченной организации в течение 90 дней (согласно Федеральному закону от 23 мая 2025 года № 121-ФЗ).`,
                  },
            ],
      },
      {
            id: 3,
            title: "Экзаменационная процедура для получения гражданства России будет стандартизирована",
            desc: [
                  {
                        type: "p",
                        text: `Правительство РФ утвердило новые правила экзаменов, необходимых для получения гражданства, которые прописывают алгоритм сдачи иностранцами тестов по русскому языку и по истории и национальному законодательству. Соответствующее постановление кабмина опубликовано на портале нормативных и правовых актов.
                              <br/><br/>
                              Языковой экзамен будет проходить в устной и письменной формах, а тестирование по истории и законодательству — только письменно, в том числе с использованием компьютера. Экзамены будут проводить 92 государственных учреждения, включая Московский центр качества образования, Государственный университет просвещения в Московской области и Уральский федеральный университет. Эти учреждения также будут организовывать тестирование для иностранцев, получающих разрешение на работу, временное проживание и вид на жительство.
                              <br/><br/>
                              Государственные учреждения самостоятельно определят расписание экзаменов и обязаны сообщать об их датах не позднее чем за неделю до проведения тестирования. Один экзамен должен длиться не более 90 минут, процесс будет фиксироваться с помощью видео- и аудионосителей. Итоги подводятся в течение одного дня после завершения тестирования.
                              <br/><br/>
                              Иностранцам запрещено пользоваться подсказками, средствами связи и справочными материалами. Нарушение этих требований приведет к аннулированию результатов. Успешно сдавшие экзамены получат сертификаты, которые будут внесены в Федеральный реестр сведений о документах об образовании и квалификации.`,
                  },
            ],
      },
      {
            id: 4,
            title: "Цифровизация въезда и выезда иностранных граждан: новый этап с 30 июня 2023 года",
            desc: [
                  {
                        type: "p",
                        text: `С 30 июня 2025 года вступает в силу вторая фаза крупного эксперимента по созданию цифровых профилей иностранных граждан, пересекающих российскую границу. 
                              <br/><br/>
                              Эксперимент продлится год и завершится 30 июня 2026 года. Ранее была проведена первая фаза, в ходе которой в основных московских аэропортах («Шереметьево», «Домодедово», «Внуково», «Жуковский») и некоторых автодорожных пунктах пропускались биометрические данные иностранных граждан — проводились фотосъемка и снятие отпечатков пальцев.
                              <br/><br/>
                              Со второго этапа иностранные граждане, посещающие Россию в безвизовом порядке, обязаны заранее пройти несколько процедур онлайн:<br/> 
                              1. Зарегистрироваться в мобильном приложении RuID.<br/>
                              2. Удаленно подтвердить личность.<br/>
                              3. Предоставить электронную заявку на въезд минимум за 72 часа до прилета. Срок действия заявки составит 90 дней.
                              <br/><br/>
                              При форс-мажорных обстоятельствах подача заявления возможна за 4 часа до пересечения границы.
                              <br/><br/>
                              От участия в эксперименте освобождаются:</span>
                              <span>Дети до 6 лет.</span>
                              <span>Граждане Беларуси.</span>
                              <span>Дипломаты и члены их семей.</span>
                              <br/>
                              Эти нововведения охватывают все контрольно-пропускные пункты России. Более подробную информацию можно найти на едином портале государственных услуг.`,
                  },
            ],
      },
      {
            id: 5,
            title: "Рособрнадзор анонсировал изменения в экзаменах для мигрантов",
            desc: [
                  {
                        type: "p",
                        text: `С 10 июля 2025 года изменится порядок проведения экзаменов для иностранных граждан, претендующих на получение разрешений на работу, временного проживания или вид на жительство в России. Ключевое изменение коснется блоков «Аудирование» и «Говорение». 
                              <br/><br/>
                              1. Количество заданий по аудированию для соискателей рабочей визы или патентов возрастет с двух до четырех.<br/>
                              2. Будет введен обязательный минимальный балл для успешной сдачи раздела «Аудирование». Недостаточный уровень оценки повлечет автоматический провал экзамена.<br/>
                              <br/>
                              Также подобные меры затронут экзамен на временную регистрацию и вид на жительство, где установят минимальные пороги оценивания по обоим указанным блокам.
                              Процесс подготовки материалов для экзаменов начнет обновляться досрочно: уже с 23 июня 2025 года количество заданий в экзаменационном банке увеличится вдвое, предоставляя будущим участникам возможность более тщательной подготовки.
                              Ознакомиться с новыми материалами можно будет на специализированном веб-ресурсе Федерального института педагогических измерений.`,
                  },
            ],
      },
      {
            id: 6,
            title: "Госдума займётся контролем над детьми мигрантов",
            desc: [
                  {
                        type: "p",
                        text: `Парламентарии Государственной Думы намерены рассмотреть инициативу, согласно которой региональные власти обязаны направлять в Министерство внутренних дел информацию о детях иностранных граждан, обучающихся в российских школах. Как сообщил спикер нижней палаты Вячеслав Володин в своём Telegram-канале, эта инициатива направлена на повышение прозрачности учёта и контроля за перемещениями мигрантов.
                              <br/><br/>
                              Документ, зарегистрированный ещё в конце апреля, предполагает изменения сразу нескольких ключевых законов, регулирующих правовой статус иностранцев, миграционные процессы и образование. Первый этап обсуждения проекта запланирован на заседание 10 июня
                              <br/><br/>
                              Что конкретно предлагают депутаты? Новый порядок подразумевает передачу ведомству МВД ряда персональных данных детей мигрантов и их семей:</span>
                              <span>Результаты тестов на владение русским языком</span>
                              <span>Информация о поступлении и исключении ребёнка из образовательного учреждения;</span>
                              <span>Данные о родителях, внесённых в специальный реестр Министерства внутренних дел.</span>
                              <br/>
                              По словам Вячеслава Володина, новая система обмена данными между органами образования и правоохранительными структурами должна обеспечить своевременность выявления нарушений правил пребывания мигрантов в стране. Помимо прочего, передача данных облегчит процесс регистрации несовершеннолетних мигрантов и обеспечит их интеграцию в российское общество.
                              <br/>
                              <br/>
                              Реализация инициативы потребует значительных ресурсов. Для модернизации федеральной информационной системы предусмотрено выделение около 125 миллионов рублей из бюджета страны. Эти средства планируется распределить между Министерством внутренних дел и Министерством цифрового развития.
                              <br/>
                              <br/>
                              Подчеркнём, что начало текущего учебного года ознаменовалось серьёзными изменениями в политике приёма детей мигрантов в российские образовательные организации. Теперь дети подлежат обязательному прохождению теста на знание русского языка перед началом обучения. Исключение сделано лишь для первоклашек, которым предстоит исключительно устная проверка. Дети, не сдавшие тестирование, временно лишаются права учиться в школе. Они смогут повторно попробовать сдать экзамен спустя три месяца.
                              <br/>
                              <br/>
                              Первые итоги внедрения новых норм оказались впечатляющими: из всех желающих поступить в учебные заведения прошло проверку всего 4% кандидатов. По состоянию на конец мая, тесты успешно завершили чуть менее половины участников. Этот показатель демонстрирует важность строгого подхода к контролю миграции и образовательной сферы.
                              `,
                  },
            ],
      },
      {
            id: 7,
            title: "Гражданство РФ для иностранных студентов",
            desc: [
                  {
                        type: "p",
                        text: `Российские власти упростили процедуру получения гражданства для иностранных студентов, успешно завершивших обучение в российских вузах с отличными результатами.
                              <br/><br/>
                              Министерство внутренних дел подтвердило, что выпускники, обладающие высокой квалификацией и ценностью для рынка труда, теперь смогут пройти ускоренную процедуру оформления вида на жительство, минуя этап временного проживания в стране.
                              Для реализации данной возможности важно соблюдение нескольких условий: учебная программа должна быть аккредитована государством, а форма обучения — исключительно очной. По данным ведомства, с начала текущего года свыше 240 иностранцев воспользовались такой льготой, причем большинство из них — граждане Китая. Ранее, в предыдущем году, аналогичный порядок применялся почти к тысяче иностранных специалистов-выпускников из разных уголков мира, включая страны СНГ, ЕС, Ближний Восток и Латинскую Америку.
                              <br/><br/>
                              Полный перечень документов, необходимых для подачи заявления, определен приказом МВД России № 417 от 11 июня 2020 года, а рассмотрение заявок осуществляется в течение максимум четырёх месяцев.
                              `,
                  },
            ],
      },
      {
            id: 8,
            title: "Минздрав отказался вводить экзамены для иностранных врачей",
            desc: [
                  {
                        type: "p",
                        text: `Минздрав России выступил против идеи проверять российских врачей-иностранцев на знание русского языка дополнительно к существующей процедуре аккредитации. 
                              <br/><br/>
                              Официальный ответ заместителя министра Татьяны Семеновой опубликован в СМИ. Сергей Леонов, председатель думского комитета по здравоохранению, ранее выразил мнение о необходимости контролировать русский язык у иностранных медиков, поступающих на работу в российскую систему здравоохранения. Однако в Минздраве указали, что такие требования нарушают действующие правовые акты, регулирующие положение иностранных граждан в России.
                              <br/><br/>
                              Заместитель главы Минздрава пояснила, что иностранцы уже предоставляют доказательства владения русским языком, знаниями истории и законодательной системы России для получения разрешений на пребывание и рабочую деятельность. Помимо этого, существует процедура обязательной аттестации зарубежного медицинского образования, проводимая исключительно на русском языке, которая охватывает оценку профессиональных знаний и навыков.
                              <br/><br/>
                              Таким образом, введение дополнительного экзамена по языку стало бы дублирующим действием и противоречило бы нормам действующего законодательства.
                              `,
                  },
            ],
      },
      {
            id: 9,
            title: "Тестирование по русскому языку для детей мигрантов",
            desc: [
                  {
                        type: "p",
                        text: `Большая часть детей мигрантов, подавших заявление на прохождение обязательного экзамена по русскому языку, не была допущена к тестированию, сообщает Рособрнадзор. Из общего числа 1762 заявлений, поданных родителями, допуск получили лишь 19%, остальным было отказано.
                              <br/><br/>
                              Причинами отказа стали неполный пакет документов, нехватка мест в школах, либо выявление ложных сведений в предоставленных бумагах. По состоянию на начало тестов, доступ к экзамену получили всего 335 детей мигрантов, из которых реально участвовали 44 ученика. Только 27 участников успешно преодолели испытание, продемонстрировав удовлетворительный уровень знания русского языка.
                              <br/><br/>
                              «Первые итоговые данные показывают эффективность нового порядка зачисления иностранных школьников в образовательные учреждения нашей страны», отметили представители ведомства.
                              <br/><br/>
                              Тем детям, кто провалил проверку, предлагается возможность дополнительного изучения русского языка перед повторной попыткой сдачи экзамена, которую разрешено предпринимать не раньше трех месяцев спустя.
                              <br/><br/>
                              Также напомнили, что школа вправе отказать ребенку в приеме, если отсутствует подтверждение легальности пребывания семьи в стране.
                              `,
                  },
            ],
      },
      {
            id: 10,
            title: "Работать в двух регионах по единому патенту",
            desc: [
                  {
                        type: "p",
                        text: `Госдума одобрила инициативу, позволяющую трудовым мигрантам официально работать в нескольких регионах одновременно.
                              <br/><br/>
                              Согласно новым правилам, иностранные граждане смогут оформить один патент, действующий сразу в двух субъектах федерации — Москве и Московской области, Санкт-Петербурге и Ленинградской области. Такое нововведение обусловлено объективными причинами: многие иностранцы вынуждены переоформлять документ дважды, сталкиваясь с двойными расходами и бюрократическими сложностями.
                              <br/><br/>
                              Ожидается, что данное изменение существенно упростит жизнь работодателей, чьи предприятия находятся в соседних регионах, поскольку теперь они смогут обойтись одним документом, а не двумя отдельными патентами. Это позволит снизить финансовую нагрузку на бизнес и облегчить процедуру оформления документов для работников-иностранцев.
                              <br/><br/>
                              Особое внимание уделено контролю над передвижениями мигрантов внутри страны. Работодатели обязаны информировать местные подразделения МВД обо всех изменениях мест трудоустройства сотрудников-мигрантов, включая работу в другом субъекте РФ. Таким образом, власти намерены обеспечить прозрачность процесса миграции и предотвратить возможные злоупотребления.
                              <br/><br/>
                              Заместитель министра финансов Алексей Сазанов подчеркнул важность предложенных изменений, отметив, что практика показывает значительное количество случаев, когда работники имели регистрацию в одном регионе, а фактически работали в соседнем, что создавало трудности как для самих мигрантов, так и для бизнеса.
                              `,
                  },
            ],
      },
      {
            id: 11,
            title: "Какие основания нужны для получения ВНЖ в России?",
            desc: [
                  {
                        type: "p",
                        text: `Многие иностранные граждане задаются таким вопросом, когда хотят оформить ВНЖ в России. В этой статье мы разберем самые распространенные основания для оформления вида на жительство в РФ. Для начала стоит отметить, что не все иностранцы вправе претендовать на получения этого статуса. 
                              <br/><br/>
                              Однозначно в рамках ФЗ «О гражданстве» расскажем, кто точно не сможет получить ВНЖ:<br/>
                              1. Люди с положительным «ВИЧ», туберкулез, наркомания (Есть исключения, если идет подача документов по близким родственникам);<br/>
                              2. Люди с непогашенной судимостью;<br/>
                              3. Люди совершившие 2 и более административных нарушения в течении одного года на территории России;<br/>
                              4. Отказ в выдаче ВНЖ может быть без объяснения причин, с формулировкой о нежелательности нахождения иностранца в стране.Теперь поговорим об основаниях которые нужны для оформления ВНЖ. Как говорили ранее, перечислим самые распространенные:<br/>
                              5. После РВП (после получения РВП можно подать на вид на жительство через 8-12 месяцев);<br/>
                              6. По детям, у которых гражданство РФ;<br/>
                              7. По родителям с гражданством РФ;<br/>
                              8. По профессии (Можно использовать редкую профессию, список профессий для получения ВНЖ в РФ утверждается один раз в год Министерством труда, в настоящее время их около 150).<br/>
                              9. По статусу носителя русского языка, так называемый НРЯ (Достаточно сложная процедура, связана она с поиском корней (Папы, Мамы, Бабушки и Дедушки которые ранее проживали либо родились в СССР) иностранного гражданина в России — это запросы в архивы, обзвон администраций и тд.)<br/>
                              <br/>
                              Вышеуказанный список не является полным, так как оснований для получения ВНЖ в РФ очень много, порой бывает так, что статус в РФ получают иностранные граждане без оснований, например за заслуги перед нашим государством или за участие в СВО.Если прочитав настоящую статью, Вы так и не определились по каким основаниям Вам подавать документы, напишите нам, либо позвоните по нижеуказанным реквизитам. Наши миграционные юристы проконсультируют Вас бесплатно.
                              `,
                  },
            ],
      },
      {
            id: 12,
            title: "Работодатель — физическое лицо, принимаем на работу иностранцев (например, для ремонта)",
            desc: [
                  {
                        type: "p",
                        text: `Работодатель физическое лицо, которое принимает на работу иностранного гражданина. Многие задаются вопросом, могут ли физические лица граждане РФ быть работодателями, да еще и принимать на работу иностранных граждан! Ответ прост, да, физические лица могут привлекать иностранных граждан на работу, но при соблюдении определенных условий. При приеме на работу иностранного гражданина необходимо удостовериться в легальности его документов. Что следует проверять при приеме на работу:
                              <br/><br/>
                              1. Наличие оригинала паспорта<br/>
                              2. Наличие миграционной карты (Цель в миграционной карте должна стоять «Работа»)<br/>
                              3. Обязательно иностранный гражданин должен быть с действующей регистрацией<br/>
                              4. У некоторых категорий иностранных граждан должен быть патент на работу (Таджикистан, Узбекистан, Азербайджан и Молдова)<br/>
                              5. Для граждан из стран входящих в ЕАЭС патент на работу не требуется (Казахстан, Армения, Белоруссия, Киргизия)<br/>
                              6. Для иностранных граждан визовых стран существует отдельный порядок, его мы рассмотрим в других статьях. После проверки документов иностранных граждан необходимо подготовить и заключить трудовой договор и уведомить ОВМ МВД по месту фактической работы иностранного гражданина.<br/>
                              <br/>
                              Для примера «Вы принимаете иностранного гражданина на работу, его трудовые обязанности сделать Вам ремонт в квартире», заключаете договор на оказание услуг (ГПД или ГПХ), далее в течении 3-х рабочих дней Вы должны уведомить ОВМ МВД РФ (Бывшее ФМС), помимо уведомления о приеме иностранного гражданина физ лицо обязано предоставить копию своего паспорта, копию ИНН, подтверждающие документы на собственность, где непосредственно будет работать иностранец и сам договор на ремонт квартиры.
                              <br/>
                              <br/>
                              Процедура достаточно сложная, неправильное заполнение документов приведет к потере времени, и есть возможность получить большой штраф. Если у Вас остались сомнения в том, сможете ли Вы самостоятельно принять иностранного гражданина на работу, настоятельно рекомендуем обратиться к нашим специалистам за помощью в проверке иностранных граждан перед приемом на работу и подготовке уведомлений в ОВМ МВД.
                              `,
                  },
            ],
      },
]);

const paramsId = ref(Number(route.params.id));

const filteredArticle = ref({
      id: null,
      title: "",
      desc: "",
});

const articleFunc = () => {
      const filterData = articles.value.find((item) => item.id === Number(paramsId.value));

      if (filterData) {
            filteredArticle.value = {
                  id: filterData.id,
                  title: filterData.title,
                  desc: filterData.desc,
            };
      } else {
            filteredArticle.value = { id: null, title: "Не найдено", desc: "" };
      }
};

watch(
      () => route.params.id,
      (newVal) => {
            paramsId.value = Number(newVal);
            articleFunc();
      },
      { immediate: true }
);
</script>

<template>
      <section class="article">
            <div class="container">
                  <div class="article__top section__top">
                        <BreadCrumb current_page="Полезные статьи" />
                        <h1 class="article__top-title section__top-title">{{ filteredArticle.title }}</h1>
                  </div>
                  <div class="article__content">
                        <div class="article__content-left">
                              <template v-for="(block, index) in filteredArticle.desc" :key="index">
                                    <h2 v-if="block.type === 'h2'">{{ block.text }}</h2>
                                    <p v-else-if="block.type === 'p'" v-html="block.text"></p>
                              </template>
                              <p>
                                    🔥🔥🔥 Все самые последние и актуальные новости для иностранных граждан в России в нашем телеграмм канале <a href="https://t.me/migrant_pcm">@t.me/migrant_pcm</a> (Telegram канал — Правовой Центр Миграции — подписываемся обязательно!) 🔥🔥🔥 <br /><br />
                                    #Экзамены #Миграция #Миграционныйучет #Россия #Гражданство РФ
                              </p>
                        </div>

                        <div class="article__content-right">
                              <Consult />
                        </div>
                  </div>
            </div>
      </section>
</template>

<style>
.article__top-title {
      max-width: 800px;
}
</style>
