<script setup>
import Button from "./Button.vue";
</script>

<template>
      <section class="reasons">
            <div class="container">
                  <div class="reasons__top section__top">
                        <h2 class="reasons__top-title section__top-title">Почему заказывают помощь юристов в суде для иностранцев?</h2>
                  </div>
                  <div class="reasons__highlight">
                        <h4 class="reasons__highlight-title">Самое главное!</h4>
                        <ul class="reasons__highlight-list">
                              <li>Мы предлагаем удобный способ оплаты: вы вносите 50% авансом перед началом нашей работы, а остаток оплачиваете, когда весь необходимый пакет документов будет готов. Принимаем все виды оплат: наличный, безналичный, оплата картами.</li>
                              <li>Мы беремся помогать в получении необходимых документов только при 100% уверенности в положительном исходе</li>
                              <li>и точно можем оценить, что для этого потребуется благодаря нашему пятнадцатилетнему опыту. Поэтому в случае возникновения каких-либо сложностей (что бывает редко), бесплатно вносим изменения в документы и не изменяем заявленной ранее стоимости.</li>
                        </ul>
                  </div>
                  <div class="reasons__content">
                        <p class="reasons__content-list">
                              Хотите защитить свои права и интересы, но вы иностранец в Москве? Не знаете, как это сделать? Тогда наша услуга судебной защиты иностранцев — именно то, что вам нужно! Мы предлагаем профессиональную юридическую помощь для защиты ваших прав в суде. Наши специалисты имеют большой опыт работы с иностранными гражданами и знают все нюансы законодательства. Наша услуга включает в себя следующие виды услуг
                              <br /><br />
                              <span class="reasons__content-list--item">Консультация по вопросам судебного процесса и защита ваших интересов в суде;</span>
                              <span class="reasons__content-list--item">Подготовка документов для подачи иска в суд;</span>
                              <span class="reasons__content-list--item">Представление интересов в суде на всех этапах процесса;</span>
                              <span class="reasons__content-list--item">Помощь в получении необходимых документов и разрешений на ведение судебного процесса.</span>
                              <br />
                              Наши услуги доступны для всех иностранных граждан, которые находятся в Москве или за пределами РФ и имеют проблемы с законом (были подвергнуты депортации или выдворению). Мы гарантируем конфиденциальность и высокое качество нашей работы. Не откладывайте защиту своих прав на потом! Обратитесь к нам уже сегодня и получите квалифицированную юридическую помощь!
                        </p>
                        <Button class="reasons__content-btn" title="Бесплатная консультация" :primary="true" size="large" />
                  </div>
            </div>
      </section>
</template>

<style>
.reasons__top-title {
      max-width: 752px;
      margin-bottom: 33px;
}
</style>
