<script setup>
import Card from "@/components/Card.vue";
import { ref } from "vue";

const services = ref([
      {
            title: "Получение квоты",
            description: "Помощь в получении квоты на разрешение временного пребывания на территории РФ",
            price: "от 7.000 ₽",
      },
      {
            title: "Получение РВПО",
            description: "Помощь в оформлении разрешения временного пребывания для проходящих обучение на территории РФ",
            price: "от 25.000 ₽",
      },
      {
            title: "Получение РВП РФ",
            description: "Помощь в оформлении разрешения временного пребывания на территории РФ",
            price: "от 35.000 ₽",
      },
      {
            title: "Получение ВНЖ РФ",
            description: "Помощь в оформлении вида на жительство на территории РФ для иностранных граждан",
            price: "от 25.000 ₽",
      },
      {
            title: "Получение Гражданства РФ",
            description: "Помощь в оформлении гражданства Российской Федерации",
            price: "от 25.000 ₽",
      },

      {
            title: "Получение статуса НРЯ",
            description: "Помощь в оформлении статуса носителя русского языка на территории РФ",
            price: "от 15.000 ₽",
      },
      {
            title: "Судебная защита иностранных граждан",
            description: "Квалифицированная защита юристов от выдворения и депортации",
            price: "от 50.000 ₽",
      },
      {
            title: "Получение ИНН для иностранца в РФ",
            description: "Помощь в оформлении ИНН для иностранных граждан, работающих на территории РФ",
            price: "от 5.000 ₽",
      },
      {
            title: "Получение СНИЛС для иностранца в РФ",
            description: "Помощь в оформлении СНИЛС для иностранных граждан, работающих на территории РФ",
            price: "от 5.000 ₽",
      },

      {
            title: "Восстановление просроченных документов иностранцам",
            description: "Помощь в оформлении СНИЛС для иностранных граждан, работающих на территории РФ",
            price: "от 5.000 ₽",
      },
      {
            title: "Подача запросов от иностранных граждан",
            description: "Помощь в оформлении СНИЛС для иностранных граждан, работающих на территории РФ",
            price: "от 5.000 ₽",
      },
]);
</script>

<template>
      <section class="services">
            <div class="container">
                  <div class="services__top section__top">
                        <h2 class="services__top-title section__top-title">Миграционные услуги  <span>для иностранных граждан</span></h2>
                        <p class="services__top-desc section__top-desc">Принимаете на работу иностранных граждан? Экономьте деньги, время и нервы, воспользовавшись нашими услугами. Мы выполняем подготовку и подачу всех необходимых документов! Вам не нужно разбираться в постоянно меняющемся законодательстве и требованиях, ждать очередей и опасаться штрафов</p>
                  </div>
                  <div class="services__cards">
                        <Card class="services__card" v-for="(item, index) in services" :bigCard="true" :key="index" :icon="false" :title="item.title" :description="item.description" :price="item.price" :btnMode="index === 0 ? 'secondary' : 'tertiary'" />
                  </div>
            </div>
      </section>
</template>

<style>
.services__top-title {
      max-width: 584px;
}
.services__top-desc {
      max-width: 884px;
}
</style>
